{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"sequential_3_input": {"name": "sequential_3_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5/sequential_3/resizing_1/resize/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_4/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_5/conv2d_4/Conv2D_ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32768"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_3_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_3/resizing_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["sequential_3_input", "StatefulPartitionedCall/sequential_5/sequential_3/resizing_1/resize/size"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/sequential_3/resizing_1/resize/ResizeBilinear", "StatefulPartitionedCall/sequential_5/conv2d_4/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_5/conv2d_4/Conv2D_ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/conv2d_4/Relu", "StatefulPartitionedCall/sequential_5/conv2d_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_5/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/conv2d_5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/sequential_5/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/conv2d_6/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/sequential_5/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/conv2d_7/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_5/max_pooling2d_5/MaxPool", "StatefulPartitionedCall/sequential_5/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/flatten_1/Reshape", "StatefulPartitionedCall/sequential_5/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/dense_2/Relu", "StatefulPartitionedCall/sequential_5/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_5/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5/dense_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5/sequential_3/resizing_1/resize/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_4/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_5/conv2d_4/Conv2D_ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_5/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_5/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_6/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_6/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_7/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_7/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5/dense_2/MatMul/ReadVariableOp", "shape": [32768, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/dense_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/dense_3/MatMul/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/dense_3/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}